## Group By

In [2]:
import pandas as pd

In [3]:
var = pd.DataFrame({"Name":["a","a","b","c","a","b","b","c","d","e"],
                    "Sub_1":[12,13,14,15,12,16,17,15,18,19],
                    "Sub_2":[21,22,23,24,25,26,27,28,29,30],})
var

  Name  Sub_1  Sub_2
0    a     12     21
1    a     13     22
2    b     14     23
3    c     15     24
4    a     12     25
5    b     16     26
6    b     17     27
7    c     15     28
8    d     18     29
9    e     19     30

In [5]:
new_var = var.groupby("Name")

In [9]:
for name, group in new_var:
    print(name)
    print(group)
    print()

a
  Name  Sub_1  Sub_2
0    a     12     21
1    a     13     22
4    a     12     25

b
  Name  Sub_1  Sub_2
2    b     14     23
5    b     16     26
6    b     17     27

c
  Name  Sub_1  Sub_2
3    c     15     24
7    c     15     28

d
  Name  Sub_1  Sub_2
8    d     18     29

e
  Name  Sub_1  Sub_2
9    e     19     30

In [10]:
new_var.get_group("a")

  Name  Sub_1  Sub_2
0    a     12     21
1    a     13     22
4    a     12     25

In [11]:
new_var.get_group("b")

  Name  Sub_1  Sub_2
2    b     14     23
5    b     16     26
6    b     17     27

In [12]:
new_var.get_group("c")

  Name  Sub_1  Sub_2
3    c     15     24
7    c     15     28

In [13]:
new_var.min()

      Sub_1  Sub_2
Name
a        12     21
b        14     23
c        15     24
d        18     29
e        19     30

In [14]:
new_var.max()

      Sub_1  Sub_2
Name
a        13     25
b        17     27
c        15     28
d        18     29
e        19     30

In [15]:
new_var.mean()

          Sub_1      Sub_2
Name
a     12.333333  22.666667
b     15.666667  25.333333
c     15.000000  26.000000
d     18.000000  29.000000
e     19.000000  30.000000

In [16]:
new_var.median()

      Sub_1  Sub_2
Name
a      12.0   22.0
b      16.0   26.0
c      15.0   26.0
d      18.0   29.0
e      19.0   30.0

In [17]:
list_1 = list(new_var)

In [18]:
list_1

[('a',
    Name  Sub_1  Sub_2
  0    a     12     21
  1    a     13     22
  4    a     12     25),
 ('b',
    Name  Sub_1  Sub_2
  2    b     14     23
  5    b     16     26
  6    b     17     27),
 ('c',
    Name  Sub_1  Sub_2
  3    c     15     24
  7    c     15     28),
 ('d',
    Name  Sub_1  Sub_2
  8    d     18     29),
 ('e',
    Name  Sub_1  Sub_2
  9    e     19     30)]